package class03;

public class Test01 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		//"요구사항" CRUD로 귀결 된다
		//create 생성 회원가입 글작성 상품구매
		//read 출력 로그인 게시글검색
		//update 변경 프로필 사진변경 글변경 상품구매
		// delete 삭제 회원탈퇴 글 삭제
		
		// 상품구매 >> 사용자가 해당상품을 구매했다는 사실이 기록
		// >> 상품 판매량 증가 
		//하나의 액션이 두가자의 의미를 가질수도 있다.
		
		// CRUD , 비즈니스메서드, 비즈니스로직, 핵심로직, 핵심관심
		
		// 학생부 프로그램 최대 5명까지 저장할수 있는 학생부가 있습니다.
		// 학생부 프로그램을 작성해주세요.
		// C :학생을 추가 (동명이인 X)
		// R :학생부를 전체출력 /학생이름으로 검색 >>selectAll
		// R :1번학생 이름출력 >>selectONe, getOne
		//* 같은 R이여도 All One 구분해야한다.
		// U: 학생의 이름변경
		// D: 학생삭제 (배열은 삭제가 안된다)
		// 개발자는 제작할때 가장 먼저 샘플 데이터를 확보 ex)학생이 존재하다고 가정하고, 
		// R selectAll 부터 제작 =>>> 임의의 데이터 생성해놓고, 잘 출력이 되는지 확인
		// 3. C부터 제작을해서, 생성한 데이터 공간에 다른데이터가 잘 추가되는지 확인

	}

}
